{
    "commandDescription": "Command to retrieve the special metadata types stored in your local project. The special types are the types generated at runtime when retrieving data from org according the package data. Files like permission sets, profiles or translations. For example, with this command you can retrieve all permissions from a profile without retrieve anything more. Also you can retrieve only the Custom Object XML Files without retrieve anything more.",
    "allFlagDescription": "Retrieve all supported metadata types (%s)",
    "typeFlagDescription": "Retrieve specifics metadata types. You can choose one or a comma separated list of elements. Also you can choose retrieve a specific profile, object o record type. Schema -> \"Type1\" or \"Type1,Type2\" or \"Type1:Object1, Type1:Object2\" or \"Type1:Object1:Item1\" for example:  \"Profile, PermissinSet\" to retrieve all profiles and permission sets. \"Profile:Admin\" to retrieve the admin profile. \"RecordType:Account:RecordType1\" to retrieve the RecordType1 for the object Account or \"RecordType:Account\" to retrieve all Record Types for Account",
    "includeOrgFlagDestription": "With this option, you can retrieve the data from org and not only for local, but only retrieve the types that you have in your local.",
    "downloadAllFlagDescription": "Option to download all Metadata Types from any Namespaces (including managed packages). If this options is not selected, only download and retrieve data from your org namespace",
    "compressFlagDescription": "Add this option to compress modified files by retrieve operation.",
    "missingTypesToRetrieveError": "You must select retrieve all or retrieve specific types",
    "runningRetrieveMessage": "Retrieving Data...",
    "loadingLocalMessage": "Describing Local Metadata Types",
    "loadingOrgMessage": "Describing Org Metadata Types",
    "afterDownloadMessage": "%s downloaded",
    "onRetrieveMessage": "Retriving Metadata Types. This operation can will take several minutes, please wait.",
    "copyFileMessage":"Copying %s to %s",
    "retrieveInProgressMessage":"%s Retrieve in progress. Please wait.",
    "retrieveFinishedMessage":"Retrieve metadata finished successfully",
    "examples": [
        "sfdx ah:metadata:local:special:retrieve -a -c -i -o",
        "sfdx ah:metadata:local:special:retrieve -t \"Profile, PermissionSet:Perm1, PermissionSet:Perm2, RecordType:Case, RecordType:Account:RtName\""
    ]
}